export const PORTRAITS_NUM: number = 3;

export interface Portrait{
    id: number,
    name: string,
    image: number,
    description: string
};

export const portraits: Portrait[] = [
    {
        id: 1,
        name: "Василь-Костянтин Острозький",
        image: require('./assets/images/ostrogski.jpg'),
        description: "(бл. 1526—1608) Український православний князь, культурно-освітній діяч, засновник слов’яно-греко-латинської школи і друкарні в Острозі, противник Берестейської церковної унії"
    },

    {
        id: 2,
        name: "Петро Конашевич-Сагайдачний",
        image: require('./assets/images/sahaidachny.jpg'),
        description: "(1570-1622) Політичний діяч, гетьман реєстрового козацтва, який очолив морські походи козаків на турецькі фортеці Ізмаїл, Трапезунд, Синоп, Кафу, допоміг польському війську розгромити турецьку армію у битві під Хотином"
    },

    {
        id: 3,
        name: "Богдан Хмельницький",
        image: require('./assets/images/khmelnytskyi.jpg'),
        description: "(1595—1657) Український військовий та державний діяч, полководець, дипломат, учасник козацько-селянських повстань 1630-х рр., керівник Національно-визвольної війни, засновник Української козацької держави, гетьман України у 1648—1657."
    },

    {
        id: 4,
        name: "Михайло Драгоманов",
        image: require('./assets/images/drahomanov.jpg'),
        description: "(1841-1895) Український громадсько-політичний діяч, історик, письменник, публіцист, один із засновників громади в Києві, діяч Південно-Західного відділу Російського географічного товариства."
    },

    {
        id: 5,
        name: "Кость Левицький",
        image: require('./assets/images/Levytsky_Kost.jpg'),
        description: "(1859—1941) Громадський, політичний і державний діяч, один із засновників Української національно-демократичної партії, депутат австрійського парламенту та Галицького сейму, керівник Головної української (згодом Загальної української) ради, засновник і голова Національної Ради у Львові."
    },

    {
        id: 6,
        name: "Дмитро Донцов",
        image: require('./assets/images/Dmytro_Doncow.jpg'),
        description: "(1883–1973) Український політичний діяч, публіцист, літературний критик, ідеолог українського націоналізму, голова Союзу визволення України, автор праць, у яких обґрунтував необхідність політичної незалежності України"
    },

    {
        id: 7,
        name: "Михайло Грушевський",
        image: require('./assets/images/Hrushevskyi_Mykhailo.jpg'),
        description: "(1866–1934) політичний і державний діяч, історик, голова Наукового товариства ім. Т. Шевченка, завідуючий кафедрою історії України Львівського університету, автор 10-томної «Історії України-Русі», один із співзасновників Товариства українських поступовців, голова Української Центральної Ради."
    },

    {
        id: 8,
        name: "Іван Котляревський",
        image: require('./assets/images/Ivan_Kotliarevsky.jpg'),
        description: "(1769-1838) Письменник, зачинатель сучасної української літератури, автор поеми «Енеїда», п’єс «Наталка-Полтавка» та «Москаль-чарівник», член полтавської масонської ложі «Любов до істини»"
    },

    {
        id: 9,
        name: "Кирило Розумовський",
        image: require('./assets/images/Razumovsky.jpg'),
        description: "(1728—1803) Останній гетьман Лівобережної України, який прагнув відновлення автономії України, розпочав проведення судової, військової і фінансової реформ, розширив права козацької старшини."
    },

    {
        id: 10,
        name: "Григорій Сковорода",
        image: require('./assets/images/skovoroda.jpg'),
        description: "(1722—1794) Просвітитель, філософ, поет, автор збірок «Сад божественних пісень», «Байки харківські», викладав поетику й етику в Переяславському та Харківському колегіумах, мандрував Україною, проповідуючи свої філософські погляди."
    },

    {
        id: 11,
        name: "Микола Костомаров",
        image: require('./assets/images/Kostomarov.jpg'),
        description: "(1817–1885) Громадсько-політичний діяч, історик, письменник, публіцист, етнограф, один із засновників Кирило-Мефодіївського товариства, автор програмного документа «Книга буття українського народу», учасник громадівського руху."
    },

    {
        id: 12,
        name: "Маркіян Шашкевич",
        image: require('./assets/images/Shashkevych.jpg'),
        description: "(1811 — 1843) Український громадський та культурно-освітній діяч, греко-католицький священик, організатор громадсько-культурного об’єднання «Руська трійця», ініціатор і співавтор альманаху «Русалка Дністрова», перекладач українською мовою «Слова о полку Ігоревім»"
    },

    {
        id: 13,
        name: 'Павло Чубинський',
        image: require('./assets/images/Chubynskyi.jpg'),
        description: "(1839–1884) Етнограф, поет, громадський діяч, учасник Київської громади, член редколегії газети «Київський телеграф», один із ініціаторів створення Південно-Західного відділу Російського географічного товариства, автор вірша «Ще не вмерла Україна…»."
    },

    {
        id: 14,
        name: 'Симон Петлюра',
        image: require('./assets/images/Petlura.jpg'),
        description: "(1879–1926) Громадсько-політичний і державний діяч, публіцист, член РУП і УСДРП, автор статті «Війна і українці», член Української Центральної Ради, секретар військових справ першого українського уряду — Генерального Секретаріату, Головний отаман військ УНР (з листопада 1918 р.). Голова Директорії УНР (9травня 1919 — 10листопада 1920)."
    },

    {
        id: 15,
        name: 'Євген Петрушевич',
        image: require('./assets/images/Petrushevych.jpg'),
        description: "(1863–1940) Український громадсько-політичний діяч, депутат австрійського парламенту та Галицького сейму, член Головної української (згодом Загальної української) ради, президент ЗУНР, після проголошення злуки УНР і ЗУНР — член Директорії, прихильник відновлення незалежності ЗУНР після підписання Варшавського договору 1920 р"
    },

    {
        id: 16,
        name: ' Нестор Махно',
        image: require('./assets/images/mahno.jpg'),
        description: "(1888–1934) Український повстанський отаман, один з лідерів анархістського руху. У січні 1919 р. розпочав боротьбу проти денікінців, військ Директорії і Антанти. Кілька разів ішов на зближення з більшовиками. З кінця листопада 1920 р. до серпня 1921 р. Махно вів боротьбу проти більшовицької влади."
    },

    {
        id: 17,
        name: ' Микола Лисенко',
        image: require('./assets/images/Lysenko.jpg'),
        description: "(1842—1912) Український композитор, диригент, піаніст, автор опер «Наталка Полтавка», «Тарас Бульба», «Різдвяна ніч», творів на тексти Т. Шевченка «Музика до Кобзаря», «Гайдамаки», організатор щорічних шевченківських концертів."
    }
];