export const PORTRAITS_NUM: number = 3;

export interface Portrait{
    id: number,
    name: string,
    image: number,
    description: string
};

export const portraits: Portrait[] = [
    {
        id: 1,
        name: "Василь-Костянтин Острозький",
        image: require('./assets/images/ostrogski.jpg'),
        description: "(бл. 1526—1608) Український православний князь, культурно-освітній діяч, засновник слов’яно-греко-латинської школи і друкарні в Острозі, противник Берестейської церковної унії"
    },

    {
        id: 2,
        name: "Петро Конашевич-Сагайдачний",
        image: require('./assets/images/sahaidachny.jpg'),
        description: "(1570-1622) Політичний діяч, гетьман реєстрового козацтва, який очолив морські походи козаків на турецькі фортеці Ізмаїл, Трапезунд, Синоп, Кафу, допоміг польському війську розгромити турецьку армію у битві під Хотином"
    },

    {
        id: 3,
        name: "Богдан Хмельницький",
        image: require('./assets/images/khmelnytskyi.jpg'),
        description: "(1595—1657) Український військовий та державний діяч, полководець, дипломат, учасник козацько-селянських повстань 1630-х рр., керівник Національно-визвольної війни, засновник Української козацької держави, гетьман України у 1648—1657."
    },

    {
        id: 4,
        name: "Михайло Драгоманов",
        image: require('./assets/images/drahomanov.jpg'),
        description: "(1841-1895) Український громадсько-політичний діяч, історик, письменник, публіцист, один із засновників громади в Києві, діяч Південно-Західного відділу Російського географічного товариства."
    }
];